# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'bramstein/webfonttools'

# Binaries
brew 'coreutils'
brew 'moreutils' # Install some other useful utilities like `sponge`.
brew 'findutils' # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'gnu-sed', args: ["with-default-names"] # Install GNU `sed`, overwriting the built-in `sed`.
brew 'wget', args: ["with-iri"]
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bash-completion2'
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'fzf'
brew 'bat'
brew 'htop'
brew 'ncdu'
brew 'tldr'
brew 'jenv'
brew 'vim', args: ["with-override-system-vi"]
brew 'openssh'
brew 'screen'
brew 'gmp'
brew 'gs'
brew 'imagemagick', args: ["with-webp"]
brew 'rename'
brew 'tree'
brew 'ssh-copy-id'
brew 'openldap'
brew 'libiconv'

# Fonts
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Development
# brew 'php'
brew 'php@7.2'
brew 'composer'
# brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'skype'
cask 'jetbrains-toolbox'
cask 'gitkraken'
cask 'atom'
cask 'adguard'
cask 'dropbox'
cask 'coderunner'
cask 'flexiglass'
cask 'macupdater'
cask 'sublime-text'
cask 'tableplus'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'WhatsApp', id: 1147396723
# mas 'FileZilla', id: 1298486723
